In [1]:
import sqlite3
import pandas as pd
import numpy as np
from io import StringIO,BytesIO

In [2]:
# From dictionary 
data = {'name':['aayush','disha','Prachi'],
       'course':['Btech','BSC','DLed'],
       'Address':['Lalitpur','Gauna','Sagar']}
df = pd.DataFrame(data)

print(df)
df.head()
df.tail()
df.describe()
df.shape
df.index
df.columns

     name course   Address
0  aayush  Btech  Lalitpur
1   disha    BSC     Gauna
2  Prachi   DLed     Sagar

Index(['name', 'course', 'Address'], dtype='object')

In [3]:
# from List of list 
data = [["Aayush",21,'Lalitpur'],["Akshay",23,'Malthone'],['Arpit',24,'Damoh']]
df = pd.DataFrame(data)
df

df.head()
df.tail()
df.describe()

               1
count   3.000000
mean   22.666667
std     1.527525
min    21.000000
25%    22.000000
50%    23.000000
75%    23.500000
max    24.000000

In [4]:
# Data retrieve from the numpy array 
arr= np.array([[12,23],[34,45]])
df = pd.DataFrame(data)
df

        0   1         2
0  Aayush  21  Lalitpur
1  Akshay  23  Malthone
2   Arpit  24     Damoh

In [5]:
df.head()

        0   1         2
0  Aayush  21  Lalitpur
1  Akshay  23  Malthone
2   Arpit  24     Damoh

In [6]:
df.tail()

        0   1         2
0  Aayush  21  Lalitpur
1  Akshay  23  Malthone
2   Arpit  24     Damoh

In [7]:
df.describe()

               1
count   3.000000
mean   22.666667
std     1.527525
min    21.000000
25%    22.000000
50%    23.000000
75%    23.500000
max    24.000000

In [8]:
df.shape

(3, 3)

In [9]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [10]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [11]:
# Retrieving of data from single CSV....
data  = pd.read_csv('C:\mercedesbenz.csv')
print(data)

        ID           y  X0  X1  X2 X3 X4  X5 X6 X8  ...  X375  X376  X377  \
0        1  100.858650  az   v   n  f  d   t  a  w  ...     0     0     0
1        2   96.851370   t   b  ai  a  d   b  g  y  ...     0     0     1
2        3   96.221504  az   v  as  f  d   a  j  j  ...     0     0     0
3        4   96.831085  az   l   n  f  d   z  l  n  ...     0     0     0
4        5  100.977974   w   s  as  c  d   y  i  m  ...     1     0     0
...    ...         ...  ..  ..  .. .. ..  .. .. ..  ...   ...   ...   ...
4204  8410  105.965890  aj   h  as  f  d  aa  j  e  ...     0     0     0
4205  8411   93.769620   t  aa  ai  d  d  aa  j  y  ...     0     1     0
4206  8413   91.628654   y   v  as  f  d  aa  d  w  ...     0     0     0
4207  8414  102.321960  ak   v  as  a  d  aa  c  q  ...     0     0     1
4208  8416   93.397700   t  aa  ai  c  d  aa  g  r  ...     1     0     0

      X378  X379  X380  X382  X383  X384  X385
0        1     0     0     0     0     0     0
1        0     0     0     0     0     0     0
2        1     0     0     0     0     0     0
3        1     0     0     0     0     0     0
4        0     0     0     0     0     0     0
...    ...   ...   ...   ...   ...   ...   ...
4204     0     0     0     0     0     0     0
4205     0     0     0     0     0     0     0
4206     0     0     0     0     0     0     0
4207     0     0     0     0     0     0     0
4208     0     0     0     0     0     0     0

[4209 rows x 378 columns]

In [12]:
# Reading from HTML pages.....
url = "https://www.w3schools.com/html/html_tables.asp"
tables = pd.read_html(url)  # returns list of DataFrames
df = tables[0]
fd = tables[1]
print(df.head())
print(fd.head())
print(df.tail())

                        Company          Contact  Country
0           Alfreds Futterkiste     Maria Anders  Germany
1    Centro comercial Moctezuma  Francisco Chang   Mexico
2                  Ernst Handel    Roland Mendel  Austria
3                Island Trading    Helen Bennett       UK
4  Laughing Bacchus Winecellars  Yoshi Tannamuri   Canada
         Tag                       Description
0    <table>                   Defines a table
1       <th>  Defines a header cell in a table
2       <tr>          Defines a row in a table
3       <td>         Defines a cell in a table
4  <caption>           Defines a table caption
                        Company           Contact  Country
1    Centro comercial Moctezuma   Francisco Chang   Mexico
2                  Ernst Handel     Roland Mendel  Austria
3                Island Trading     Helen Bennett       UK
4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy

In [2]:
import pandas as pd
import numpy as np
from io import StringIO , BytesIO

In [31]:
df = pd.read_excel('C:\Fetch_Excel.xlsx')
df.head()

      name Class   Rollno  College
0   aayush     B1  4365464    BTIRT
1  Shivani     C3  4546456     IGEC
2    Sahil     D5   654546    Adina
3   Sanjay     D5    54654     Sips
4   Sonam      C8    56756    BTIRT

In [4]:
# Describe function gives the quick summary of the data 
df.describe()

            Rollno
count  7.000000e+00
mean   1.493183e+06
std    2.042109e+06
min    5.465400e+04
25%    7.776050e+04
50%    6.545460e+05
75%    2.520554e+06
max    4.546456e+06

In [5]:
# We use info command to see the quick report about the DataFrame..
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      7 non-null      object
 1   Class     7 non-null      object
 2   Rollno    7 non-null      int64
 3   College   7 non-null      object
dtypes: int64(1), object(3)
memory usage: 356.0+ bytes

In [43]:
# If the number of sheet is there inside the excel ,then we can retrieve the sinle sheet also ..

# @ Header : that contains the row names 
# @ names : names = ['Names','batch','Rollno','college'] :It will clarify the column name insie the table ..
# @ index_col : It will show the index mark column as first column ...
# @ uscols  : it will read only selected columns ..
# @ dtype : set data types 
# @ skiprows :  skip specific rows from the table ..
# @ nrows : read only first N rows ..
# @ na_values : if there is any value where there is nothing written over there then we will use na_values
#                to fill here like null,-

data = 'C:\Fetch_Excel.xlsx'
dd = pd.read_excel(data,sheet_name='Sheet1',header=0,names=['name','Stream','enrollmentno','College']
                  ,index_col=0,usecols=['name','Stream'],dtype={'Rollno':int})
dd = pd.read_excel(data,dtype={'Rollno' : int})
dd = pd.read_excel(data,nrows=1)

In [48]:
# na_values function write the null or NAN where there is no values inserted at that place ....
file = pd.read_excel('C:\Fetch_Excel_null.xlsx',na_values = ['null','--','NA'])
file

         name Class     Rollno    College
0      aayush     B1  4365464.0      BTIRT
1     Shivani     C3  4546456.0       IGEC
2       Sahil     D5   654546.0      Adina
3      Sanjay     D5    54654.0       Sips
4      Sonam      C8    56756.0      BTIRT
5       Veer      F7   675643.0       IGEC
6  Veerendra      D5    98765.0       IGEC
7      aayush     R4        NaN      BTIRT
8    Rajendra    NaN   876543.0  GyanSagar

In [51]:
# parse_dates Function : This function is used to convert the column into data time
file =  pd.read_excel('C:\Fetch_Excel_null.xlsx')
file

         name Class     Rollno    College
0      aayush     B1  4365464.0      BTIRT
1     Shivani     C3  4546456.0       IGEC
2       Sahil     D5   654546.0      Adina
3      Sanjay     D5    54654.0       Sips
4      Sonam      C8    56756.0      BTIRT
5       Veer      F7   675643.0       IGEC
6  Veerendra      D5    98765.0       IGEC
7      aayush     R4        NaN      BTIRT
8    Rajendra    NaN   876543.0  GyanSagar